<a href="https://colab.research.google.com/github/mufqam/rifqiprogress/blob/mufqam/Assignment_Bootcamp_Dibimbing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Assignment Bootcamp - Dibimbing
Name: Mohamad Rifki Ilham

Date: 24 Sep 2021

In [ ]:
import pandas as pd
import numpy as np

QUESTION 1

In [ ]:
df = pd.DataFrame({
    'Name':['Aldo', 'Bryan', 'Cindy', 'Dilan', 'Erika', 'Fitri', 'Gerald', 'Halim'],
    'Score':[80, 85, 87, 75, 77, 83, 79, 83]
})

In [ ]:
df

NameError: ignored

In [ ]:
df['Score'].max()

87

In [ ]:
df.nlargest(3, 'Score')

    Name  Score
2  Cindy     87
1  Bryan     85
5  Fitri     83

In [ ]:
df.nsmallest(5, 'Score')

     Name  Score
3   Dilan     75
4   Erika     77
6  Gerald     79
0    Aldo     80
5   Fitri     83

QUESTION 2

In [ ]:
df_2 = pd.DataFrame({
    'Single Value':[0,1,3,4,7]
})

In [ ]:
df_2

   Single Value
0             0
1             1
2             3
3             4
4             7

In [ ]:
df_2['c_sum'] = df_2['Single Value'].cumsum()
df_2

   Single Value  c_sum
0             0      0
1             1      1
2             3      4
3             4      8
4             7     15

QUESTION 3
Write an if..else… code in Python to check whether a word is a palindrome or not.

Input: ‘malam’

Output: ‘malam’ is a Palindrome

Input: ‘ABBA’

Output: ‘ABBA’ is a Palindrome

Input: ‘Python’

Output: ‘Python’ is not a Palindrome.

In [ ]:
p = input("Masukkan nilai : ")

reverse = p[::-1]

if (p == reverse ):
  print("is a Palindrome")
else:
  print("is not a Palindrome")

Masukkan nilai : MALAM
is a Palindrome

QUESTION 4

In [ ]:
df_4 = pd.DataFrame({
    'Buyer':['Aldo', 'Budi', 'Cindy', 'Dilan'],
    'Items':[['book', 'magazine'], ['realme 8', 'screen protector'],
                   ['iPhone 11', 'power bank'], ['face shield', 'mask', 'hand sanitizer']]
})

In [ ]:
df_4

   Buyer                                Items
0   Aldo                     [book, magazine]
1   Budi         [realme 8, screen protector]
2  Cindy              [iPhone 11, power bank]
3  Dilan  [face shield, mask, hand sanitizer]

In [ ]:
hasil = pd.DataFrame([(d, tup.Buyer) for tup in df_4.itertuples() for d in tup.Items])
print(hasil)

NameError: ignored

QUESTION 5

In [ ]:
df_5 = pd.DataFrame({
    'Item 1':['Buku', 'Buku', 'Majalah', 'iPhone', 'iPhone', 'Alat Tulis', 'Mouse', 'Keyboard'],
    'Item 2' : ['Majalah', 'Koran', 'Buku', 'Charger', 'Power Bank', 'Buku', 'Keyboard', 'Mouse']
})

In [ ]:
df_5

       Item 1      Item 2
0        Buku     Majalah
1        Buku       Koran
2     Majalah        Buku
3      iPhone     Charger
4      iPhone  Power Bank
5  Alat Tulis        Buku
6       Mouse    Keyboard
7    Keyboard       Mouse

In [ ]:
def duplicate(x):
  return list(dict.fromkeys(x))

  df_5 = duplicate(['Buku', 'Buku', 'Majalah', 'iPhone', 'iPhone', 'Alat Tulis', 'Mouse', 'Keyboard', 'Majalah', 'Koran', 'Buku', 'Charger', 'Power Bank', 'Buku', 'Keyboard', 'Mouse'])
  print(df_5)